# LeetCode Problem 181: Employees Earning More Than Their Managers

## Problem

Table: Employees
```
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
| salary      | int     |
| managerId   | int     |
+-------------+---------+
```
id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager. 

Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

The result format is in the following example.

### Example 1:

Input:
Employee table:
```
+----+-------+--------+-----------+
| id | name  | salary | managerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | Null      |
| 4  | Max   | 90000  | Null      |
+----+-------+--------+-----------+
```
Output:
``` 
+----------+
| Employee |
+----------+
| Joe      |
+----------+
```
Explanation: Joe is the only employee who earns more than his manager.

*Link to problem: [https://leetcode.com/problems/employees-earning-more-than-their-managers/](https://leetcode.com/problems/employees-earning-more-than-their-managers/)*

## SQL Solution

In [ ]:
from dotenv import load_dotenv
import os

load_dotenv()
db_user = os.getenv('DB_USER')
db_pass = os.getenv('DB_PASS')
db_name = os.getenv('DB_NAME')

In [ ]:
%load_ext sql

In [ ]:
%sql mysql+pymysql://{db_user}:{db_pass}@localhost/{db_name}

In [ ]:
%sql SHOW TABLES;

In [ ]:
%%sql

CREATE TABLE IF NOT EXISTS Employee(id int, name varchar(255), salary int, managerId int);
TRUNCATE TABLE Employee;
INSERT INTO Employee (id, name, salary, managerId) VALUES ('1', 'Joe', '70000', '3');
INSERT INTO Employee (id, name, salary, managerId) VALUES ('2', 'Henry', '80000', '4');
INSERT INTO Employee (id, name, salary, managerId) VALUES ('3', 'Sam', '60000', NULL);
INSERT INTO Employee (id, name, salary, managerId) VALUES ('4', 'Max', '90000', NULL);
SELECT * FROM Employee;

In [ ]:
%%sql
SELECT *
FROM Employee AS e1 INNER JOIN Employee AS e2 ON e1.managerId=e2.id;

In [ ]:
%%sql
SELECT e1.name AS 'Employee'
FROM Employee AS e1 INNER JOIN Employee AS e2 ON e1.managerId=e2.id
WHERE e1.salary>e2.salary;

In [ ]:
%sql DROP TABLE IF EXISTS Employee;

## Pandas Solution

In [ ]:
import pandas as pd

In [ ]:
data = {'id': [1,2,3,4],
        'name': ['Joe', 'Henry', 'Sam', 'Max'],
        'salary': [70000, 80000, 60000, 90000],
        'managerId': [3,4, None, None]}

Employee = pd.DataFrame(data).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

Employee

In [ ]:
def find_employees(employee: pd.DataFrame) -> pd.DataFrame:
    
    e1 = Employee.copy()
    e2 = Employee.copy()

    e = e1.merge(right=e2, how='inner', left_on='managerId', right_on='id').query('salary_x > salary_y').name_x

    return e.to_frame(name='Employee')

In [ ]:
find_employees(Employee)